read_verilog -sv -formal -overwrite {workspace}/original_code/MISO_phase_selector.v
design -reset-vlog; proc;
write_json {workspace}/netlist/MISO_phase_selector.json